sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
    if (direction == RBSP_GPIO_OUTPUT) {
        HAL_GPIO_WritePin(port, (uint16_t)(1U << pin_index),
                          initial_value ? GPIO_PIN_SET : GPIO_PIN_RESET);
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << pin_index);
    init.Mode = direction == RBSP_GPIO_OUTPUT
                    ? GPIO_MODE_OUTPUT_PP
                    : GPIO_MODE_INPUT;
    init.Pull = GPIO_NOPULL;
    /*
     * PC13..PC15 由备份域电源开关供电，数据手册限制为最高 2MHz，
     * 因此即使作为普通输出也只选择低速档。
     */
    init.Speed = (port_index == 2U && pin_index >= 13U)
                     ? GPIO_SPEED_FREQ_LOW
                     : GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(port, &init);
    return true;
}

static bool board_gpio_write(uint16_t encoded_pin, bool value) {
    if (!gpio_pin_allowed(encoded_pin)) {
        return false;
    }
    GPIO_TypeDef* port =
        gpio_port_from_index((uint8_t)(encoded_pin / 16U));
    HAL_GPIO_WritePin(
        port, (uint16_t)(1U << (encoded_pin % 16U)),
        value ? GPIO_PIN_SET : GPIO_PIN_RESET);
    return true;
}

static bool board_gpio_read(uint16_t encoded_pin, bool* value) {
    if (!gpio_pin_allowed(encoded_pin) || value == NULL) {
        return false;
    }
    GPIO_TypeDef* port =
        gpio_port_from_index((uint8_t)(encoded_pin / 16U));
    *value = HAL_GPIO_ReadPin(
                 port, (uint16_t)(1U << (encoded_pin % 16U))) ==
             GPIO_PIN_SET;
    return true;
}

#ifdef CONFIG_REMOTEBSP_MOTION
static void motion_write_pin(motion_pin_t pin, bool high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    gpio->BSRR = high ? mask : (uint32_t)mask << 16U;
}

static void motion_configure_output(motion_pin_t pin, bool initial_high) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    const uint16_t mask = (uint16_t)(1U << pin.pin);
    enable_gpio_clock(pin.port);
    motion_write_pin(pin, initial_high);
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = (pin.port == 2U && pin.pin >= 13U)
                     ? GPIO_SPEED_FREQ_LOW
                     : GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
}

#ifdef CONFIG_MOTION_SLOT_LIMIT_INPUTS
static void motion_configure_limit_input(motion_pin_t pin) {
    GPIO_TypeDef* const gpio = gpio_port_from_index(pin.port);
    enable_gpio_clock(pin.port);
    GPIO_InitTypeDef init = {0};
    init.Pin = (uint16_t)(1U << pin.pin);
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_PULLUP;
    init.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(gpio, &init);
}
#endif

/*
 * 运动引脚不依赖运行时 GPIO 对象。上电即先禁用所有驱动器，再固定为推挽输出，
 * 避免资源创建失败或主循环阻塞时产生悬空 STEP 脉冲。
 */
static void motion_outputs_configure(void) {
    for (uint8_t axis = 0U; axis < MOTION_SLOT_AXIS_COUNT; ++axis) {
        const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
        /* 失效电平由每个槽位的 menuconfig 极性决定。 */
        motion_configure_output(pins->enable, pins->enable_active_low);
        motion_configure_output(pins->step, false);
        motion_configure_output(pins->direction,
                                pins->direction_inverted);
#ifdef CONFIG_MOTION_SLOT_LIMIT_INPUTS
        if (motion_limit_pins[axis].present) {
            motion_configure_limit_input(motion_limit_pins[axis].pin);
        }
#endif
    }
}

static bool board_motion_set_enable(uint8_t axis, bool enabled) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
    motion_write_pin(pins->enable, enabled != pins->enable_active_low);
    return true;
}

static bool board_motion_set_direction(uint8_t axis, bool positive) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    const motion_axis_pins_t* const pins = &motion_axis_pins[axis];
    motion_write_pin(pins->direction,
                     positive != pins->direction_inverted);
    return true;
}

static bool board_motion_set_step(uint8_t axis, bool high) {
    if (axis >= MOTION_SLOT_AXIS_COUNT) {
        return false;
    }
    motion_write_pin(motion_axis_pins[axis].step, high);
    return true;
}

#ifdef CONFIG_MOTION_SLOT_LIMIT_INPUTS
static bool board_motion_limit_active(uint8_t axis, bool* active) {
    if (axis >= MOTION_SLOT_AXIS_COUNT || active == NULL) {
        return false;
    }
    const motion_limit_pin_t* const limit = &motion_limit_pins[axis];
    if (!limit->present) {
        *active = false;
        return true;
    }
    GPIO_TypeDef* const gpio = gpio_port_from_index(limit->pin.port);
    const uint16_t mask = (uint16_t)(1U << limit->pin.pin);
    /* 限位开关使用上拉输入，闭合接地即为触发。 */
    *active = (gpio->IDR & mask) == 0U;
    return true;
}
#endif

/* TIM2 以 1MHz 自由运行，配合溢出计数形成单调 64 位运动时钟。 */
static void motion_timebase_configure(void) {
    __HAL_RCC_TIM2_CLK_ENABLE();
    TIM2->CR1 = 0U;
    TIM2->PSC = 47U;
    TIM2->ARR = UINT32_MAX;
    TIM2->EGR = TIM_EGR_UG;
    TIM2->CNT = 0U;
    TIM2->SR = 0U;
    TIM2->DIER = TIM_DIER_UIE;
    motion_timebase_epochs = 0U;
    HAL_NVIC_SetPriority(TIM2_IRQn, 1U, 0U);
    HAL_NVIC_EnableIRQ(TIM2_IRQn);
    TIM2->CR1 = TIM_CR1_CEN;
}

static uint64_t board_motion_nanoseconds(void) {
    uint32_t before;
    uint32_t after;
    uint32_t counter;
    do {
        before = motion_timebase_epochs;
        counter = TIM2->CNT;
        after = motion_timebase_epochs;
    } while (before != after);
    if ((TIM2->SR & TIM_SR_UIF) != 0U && counter < UINT32_C(0x80000000)) {
        ++after;
    }
    return (((uint64_t)after << 32U) | counter) * 1000ULL;
}

/* TIM3 是独立的 STEP 调度中断，TIM17 继续保留给可选软串口。 */
static void motion_tick_timer_start(void) {
    __HAL_RCC_TIM3_CLK_ENABLE();
    TIM3->CR1 = 0U;
    TIM3->PSC = 0U;
    TIM3->ARR =
        (uint16_t)(CONFIG_SYSTEM_CLOCK_HZ / CONFIG_MOTION_TIMER_HZ - 1U);
    TIM3->EGR = TIM_EGR_UG;
    TIM3->CNT = 0U;
    TIM3->SR = 0U;
    TIM3->DIER = TIM_DIER_UIE;
    HAL_NVIC_SetPriority(TIM3_IRQn, 0U, 0U);
    HAL_NVIC_EnableIRQ(TIM3_IRQn);
    TIM3->CR1 = TIM_CR1_CEN;
}
#endif

#ifdef CONFIG_REMOTEBSP_SOFT_HALF_DUPLEX_UART
/* TIM17 以 48MHz 自由运行，为软串口提供独立于 SysTick 的周期级时基。 */
static void soft_uart_timer_configure(void) {
    __HAL_RCC_TIM17_CLK_ENABLE();
    TIM17->CR1 = 0U;
    TIM17->PSC = 0U;
    TIM17->ARR = UINT16_MAX;
    TIM17->EGR = TIM_EGR_UG;
    TIM17->CNT = 0U;
    TIM17->CR1 = TIM_CR1_CEN;
}

static GPIO_TypeDef* soft_uart_gpio_port(uint8_t port) {
    return port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
                   port < MOTION_SLOT_SOFT_UART_PORTS &&
                   soft_uart_port_present[port]
               ? gpio_port_from_index(soft_uart_gpio_ports[port])
               : NULL;
}

static uint16_t soft_uart_gpio_mask(uint8_t port) {
    return port < CONFIG_SOFT_HALF_DUPLEX_UART_PORT_COUNT &&
                   port < MOTION_SLOT_SOFT_UART_PORTS &&
                   soft_uart_port_present[port]
               ? (uint16_t)(1U << soft_uart_gpio_pins[port])
               : 0U;
}

static bool soft_uart_port_prepare(void* context, uint8_t port) {
    (void)context;
    if (soft_uart_gpio_port(port) == NULL ||
        soft_uart_gpio_mask(port) == 0U) {
        return false;
    }
    enable_gpio_clock(soft_uart_gpio_ports[port]);
    return true;
}

