sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
static bool soft_uart_set_output(void* context, uint8_t port, bool high) {
    (void)context;
    GPIO_TypeDef* gpio = soft_uart_gpio_port(port);
    const uint16_t mask = soft_uart_gpio_mask(port);
    if (gpio == NULL || mask == 0U) {
        return false;
    }
    gpio->BSRR = high ? mask : (uint32_t)mask << 16U;
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_OUTPUT_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = (soft_uart_gpio_ports[port] == 2U &&
                  soft_uart_gpio_pins[port] >= 13U)
                     ? GPIO_SPEED_FREQ_LOW
                     : GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
    return true;
}

static bool soft_uart_set_input(void* context, uint8_t port) {
    (void)context;
    GPIO_TypeDef* gpio = soft_uart_gpio_port(port);
    const uint16_t mask = soft_uart_gpio_mask(port);
    if (gpio == NULL || mask == 0U) {
        return false;
    }
    GPIO_InitTypeDef init = {0};
    init.Pin = mask;
    init.Mode = GPIO_MODE_INPUT;
    init.Pull = GPIO_PULLUP;
    init.Speed = (soft_uart_gpio_ports[port] == 2U &&
                  soft_uart_gpio_pins[port] >= 13U)
                     ? GPIO_SPEED_FREQ_LOW
                     : GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(gpio, &init);
    return true;
}

static bool soft_uart_read_input(void* context, uint8_t port, bool* high) {
    (void)context;
    GPIO_TypeDef* gpio = soft_uart_gpio_port(port);
    const uint16_t mask = soft_uart_gpio_mask(port);
    if (gpio == NULL || mask == 0U || high == NULL) {
        return false;
    }
    *high = (gpio->IDR & mask) != 0U;
    return true;
}

static void soft_uart_delay_ticks(void* context, uint32_t ticks) {
    (void)context;
    const uint16_t started = (uint16_t)TIM17->CNT;
    while ((uint16_t)((uint16_t)TIM17->CNT - started) < ticks) {
    }
}

static uint32_t soft_uart_irq_save_disable(void* context) {
    (void)context;
    const uint32_t state = __get_PRIMASK();
    __disable_irq();
    return state;
}

static void soft_uart_irq_restore(void* context, uint32_t state) {
    (void)context;
    if (state == 0U) {
        __enable_irq();
    }
}

static bool board_soft_uart_configure(uint8_t port, uint32_t baud_rate,
                                      uint8_t data_bits, uint8_t stop_bits,
                                      uint8_t parity) {
    return rbsp_soft_half_duplex_uart_configure(
        &soft_uart, port, baud_rate, data_bits, stop_bits, parity);
}

static size_t board_soft_uart_read(uint8_t port, uint8_t* data,
                                   size_t capacity) {
    return rbsp_soft_half_duplex_uart_read(&soft_uart, port, data, capacity);
}

static bool board_soft_uart_write(uint8_t port, const uint8_t* data,
                                  size_t length) {
#ifdef CONFIG_REMOTEBSP_MOTION
    /* 定时器节拍由运动核心消费，并在各轴输出 STEP 脉冲。 */
    if (remote_core.motion.state == RBSP_MOTION_ARMED ||
        remote_core.motion.state == RBSP_MOTION_RUNNING) {
        return false;
    }
#endif
    return rbsp_soft_half_duplex_uart_write(&soft_uart, port, data, length);
}
#endif

void HAL_CAN_MspInit(CAN_HandleTypeDef* handle) {
    if (handle->Instance != CAN) {
        return;
    }
    __HAL_RCC_CAN1_CLK_ENABLE();

    GPIO_InitTypeDef init = {0};
#if defined(CONFIG_CAN_PINS_PA11_PA12)
    __HAL_RCC_GPIOA_CLK_ENABLE();
    init.Pin = GPIO_PIN_11 | GPIO_PIN_12;
#else
    __HAL_RCC_GPIOB_CLK_ENABLE();
    init.Pin = GPIO_PIN_8 | GPIO_PIN_9;
#endif
    init.Mode = GPIO_MODE_AF_PP;
    init.Pull = GPIO_NOPULL;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    init.Alternate = GPIO_AF4_CAN;
#if defined(CONFIG_CAN_PINS_PA11_PA12)
    HAL_GPIO_Init(GPIOA, &init);
#else
    HAL_GPIO_Init(GPIOB, &init);
#endif
}

#ifdef RBSP_HARDWARE_UART_ENABLED
void HAL_UART_MspInit(UART_HandleTypeDef* handle) {
    if (handle->Instance != USART1) {
        return;
    }
    __HAL_RCC_USART1_CLK_ENABLE();

    GPIO_InitTypeDef init = {0};
#if defined(CONFIG_UART0_PINS_PA9_PA10)
    __HAL_RCC_GPIOA_CLK_ENABLE();
    init.Pin = GPIO_PIN_9 | GPIO_PIN_10;
    init.Alternate = GPIO_AF1_USART1;
    init.Mode = GPIO_MODE_AF_PP;
    init.Pull = GPIO_PULLUP;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOA, &init);
#else
    __HAL_RCC_GPIOB_CLK_ENABLE();
    init.Pin = GPIO_PIN_6 | GPIO_PIN_7;
    init.Alternate = GPIO_AF0_USART1;
    init.Mode = GPIO_MODE_AF_PP;
    init.Pull = GPIO_PULLUP;
    init.Speed = GPIO_SPEED_FREQ_HIGH;
    HAL_GPIO_Init(GPIOB, &init);
#endif
}

static bool board_uart_configure(uint8_t port, uint32_t baud_rate,
                                 uint8_t data_bits, uint8_t stop_bits,
                                 uint8_t parity) {
    if (port != 0U || baud_rate < 300U || baud_rate > 3000000U ||
        stop_bits < 1U || stop_bits > 2U || parity > 2U) {
        return false;
    }

    uint32_t word_length;
    if (parity == 0U && data_bits == 8U) {
        word_length = UART_WORDLENGTH_8B;
    } else if (parity != 0U && data_bits == 7U) {
        word_length = UART_WORDLENGTH_8B;
    } else if (parity != 0U && data_bits == 8U) {
        word_length = UART_WORDLENGTH_9B;
    } else {
        return false;
    }

    HAL_NVIC_DisableIRQ(USART1_IRQn);
    uart0_configured = false;
    if (uart0_handle.Instance == USART1) {
        (void)HAL_UART_DeInit(&uart0_handle);
    }
    rbsp_byte_ring_clear(&uart0_rx_ring);
    rbsp_byte_ring_clear(&uart0_tx_ring);

    uart0_handle.Instance = USART1;
    uart0_handle.Init.BaudRate = baud_rate;
    uart0_handle.Init.WordLength = word_length;
    uart0_handle.Init.StopBits =
        stop_bits == 1U ? UART_STOPBITS_1 : UART_STOPBITS_2;
    uart0_handle.Init.Parity =
        parity == 0U ? UART_PARITY_NONE
                     : (parity == 1U ? UART_PARITY_ODD
                                     : UART_PARITY_EVEN);
    uart0_handle.Init.Mode = UART_MODE_TX_RX;
    uart0_handle.Init.HwFlowCtl = UART_HWCONTROL_NONE;
    uart0_handle.Init.OverSampling = UART_OVERSAMPLING_16;
    uart0_handle.Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE;
    uart0_handle.AdvancedInit.AdvFeatureInit =
        UART_ADVFEATURE_NO_INIT;
    if (HAL_UART_Init(&uart0_handle) != HAL_OK) {
        return false;
    }

