sendu2wfdx/RemoteBSP/firmware/boards/stm32f072rbt6/main.c
    for (;;) {
        receive_can_frames();
        rbsp_core_poll(&remote_core);
    }
}

void SysTick_Handler(void) {
    HAL_IncTick();
}

#ifdef CONFIG_REMOTEBSP_MOTION
void TIM2_IRQHandler(void) {
    if ((TIM2->SR & TIM_SR_UIF) != 0U) {
        TIM2->SR &= ~TIM_SR_UIF;
        ++motion_timebase_epochs;
    }
}

void TIM3_IRQHandler(void) {
    if ((TIM3->SR & TIM_SR_UIF) != 0U) {
        TIM3->SR &= ~TIM_SR_UIF;
        /* 空闲时不进入通用运动内核，把 CPU 和 CAN 接收时间还给主循环。 */
        if (remote_core.motion.state == RBSP_MOTION_ARMED ||
            remote_core.motion.state == RBSP_MOTION_RUNNING) {
            (void)rbsp_core_motion_tick(&remote_core);
        }
    }
}
#endif

#ifdef RBSP_HARDWARE_UART_ENABLED
void USART1_IRQHandler(void) {
    if (!uart0_configured) {
        return;
    }

    const uint32_t status = uart0_handle.Instance->ISR;
    const uint32_t error_flags =
        USART_ISR_ORE | USART_ISR_NE | USART_ISR_FE | USART_ISR_PE;
    if ((status & USART_ISR_RXNE) != 0U) {
        const uint8_t value = (uint8_t)uart0_handle.Instance->RDR;
        if (rbsp_byte_ring_push(&uart0_rx_ring, value)) {
            ++rbsp_diag_uart_rx_bytes;
        } else {
            ++rbsp_diag_uart_rx_overflows;
        }
    }
    if ((status & error_flags) != 0U) {
        uart0_handle.Instance->ICR =
            USART_ICR_ORECF | USART_ICR_NCF |
            USART_ICR_FECF | USART_ICR_PECF;
        ++rbsp_diag_uart_errors;
    }

    if ((uart0_handle.Instance->ISR & USART_ISR_TXE) != 0U &&
        (uart0_handle.Instance->CR1 & USART_CR1_TXEIE) != 0U) {
        uint8_t value;
        if (rbsp_byte_ring_pop(&uart0_tx_ring, &value)) {
            uart0_handle.Instance->TDR = value;
            ++rbsp_diag_uart_tx_bytes;
        } else {
            __HAL_UART_DISABLE_IT(&uart0_handle, UART_IT_TXE);
        }
    }
}
#endif
